myrottenpotatoes/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "movies" SET "title" = ?, "rating" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "The Marvels"], ["rating", "PG"], ["updated_at", "2023-11-26 03:24:28.552910"], ["id", 26]]
---
  def update
    @movie = Movie.find params[:id]
    if (@movie.update(movie_params))